; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon18)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image1)
	(calibration_target instrument7 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon18)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph2)
	(supports instrument10 image1)
	(calibration_target instrument10 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Phenomenon20)
	(pointing satellite2 Star21)
	(pointing satellite3 Star21)
	(pointing satellite4 Phenomenon9)
	(have_image Star5 image1)
	(have_image Planet6 thermograph2)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 image1)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Phenomenon18 image1)
	(have_image Planet19 thermograph2)
	(have_image Phenomenon20 image1)
	(have_image Star21 thermograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 20
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 20
3. (turn_to satellite4 phenomenon9 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 20
4. (turn_to satellite4 star1 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star1)
   goals met: 0 of 20
5. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 20
6. (turn_to satellite4 phenomenon12 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 20
7. (take_image satellite4 phenomenon12 instrument10 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 1 of 20
8. (turn_to satellite4 phenomenon18 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon18)
   goals met: 1 of 20
9. (take_image satellite4 phenomenon18 instrument10 image1)
   added: (have_image phenomenon18 image1)
   goals met: 2 of 20
10. (turn_to satellite4 phenomenon20 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 20
11. (take_image satellite4 phenomenon20 instrument10 image1)
   added: (have_image phenomenon20 image1)
   goals met: 3 of 20
12. (turn_to satellite4 phenomenon8 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon8)
   goals met: 3 of 20
13. (take_image satellite4 phenomenon8 instrument10 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 4 of 20
14. (turn_to satellite4 phenomenon9 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon9)
   goals met: 5 of 20
15. (take_image satellite4 phenomenon9 instrument10 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 6 of 20
16. (turn_to satellite3 groundstation2 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation2)
   goals met: 6 of 20
17. (calibrate satellite3 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 6 of 20
18. (turn_to satellite3 phenomenon13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 20
19. (take_image satellite3 phenomenon13 instrument8 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 7 of 20
20. (turn_to satellite3 phenomenon15 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon15)
   goals met: 7 of 20
21. (take_image satellite3 phenomenon15 instrument8 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 8 of 20
22. (turn_to satellite3 phenomenon16 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon16)
   goals met: 8 of 20
23. (take_image satellite3 phenomenon16 instrument8 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 9 of 20
24. (turn_to satellite3 phenomenon17 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 phenomenon17)
   goals met: 9 of 20
25. (take_image satellite3 phenomenon17 instrument8 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 10 of 20
26. (turn_to satellite3 planet10 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 planet10)
   goals met: 10 of 20
27. (take_image satellite3 planet10 instrument8 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 11 of 20
28. (turn_to satellite3 planet14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet14)
   goals met: 11 of 20
29. (take_image satellite3 planet14 instrument8 image1)
   added: (have_image planet14 image1)
   goals met: 12 of 20
30. (turn_to satellite3 star21 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 star21)
   goals met: 13 of 20
31. (turn_to satellite2 star21 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 star21)
   goals met: 14 of 20
32. (turn_to satellite0 phenomenon20 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon20)
   goals met: 15 of 20
33. (turn_to satellite4 planet19 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet19)
   goals met: 14 of 20
34. (take_image satellite4 planet19 instrument10 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 15 of 20
35. (turn_to satellite4 phenomenon9 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 phenomenon9)
   goals met: 16 of 20
36. (turn_to satellite4 planet6 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet6)
   goals met: 15 of 20
37. (take_image satellite4 planet6 instrument10 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 16 of 20
38. (turn_to satellite4 phenomenon9 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 phenomenon9)
   goals met: 17 of 20
39. (turn_to satellite4 planet7 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet7)
   goals met: 16 of 20
40. (take_image satellite4 planet7 instrument10 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 17 of 20
41. (turn_to satellite4 phenomenon9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 phenomenon9)
   goals met: 18 of 20
42. (turn_to satellite4 star21 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star21)
   goals met: 17 of 20
43. (take_image satellite4 star21 instrument10 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 18 of 20
44. (turn_to satellite4 phenomenon9 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 phenomenon9)
   goals met: 19 of 20
45. (turn_to satellite4 star5 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star5)
   goals met: 18 of 20
46. (take_image satellite4 star5 instrument10 image1)
   added: (have_image star5 image1)
   goals met: 19 of 20
47. (turn_to satellite4 phenomenon9 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 phenomenon9)
   goals met: 20 of 20
